punto_back/scripts/loadTesting/createUser.yaml
config:
  target: "http://localhost:3500" # Replace with the URL of your application
  phases:
    - duration: 60
      arrivalRate: 1
scenarios:
  - name: "Create user"
    flow:
      - log: "New virtual user running"
      - post:
          url: "/users"
          json:
            email: "{{ $randomString() }}"
            username: "{{ $randomString() }}"
            password: "test"
            birthday: "27/10/1994"
          capture:
            json: "$.message"
            as: "msg"
            log: "User created"